# 01. Importing libraries

In [16]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [17]:
# Path
path = r'C:\Users\ideal\Task 4.6 Merging'

In [18]:
# importing dataframe "df_products"
df_products = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

In [19]:
# importing dataframe "df_ords_products_combined"
df_ords_products_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [20]:
df_products.shape

(49672, 6)

In [21]:
df_ords_products_combined.shape

(32434489, 11)

In [22]:
df_products.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [23]:
# Dropping the "Unnamed: 0" column from df_products
df_products = df_products.drop(columns = ['Unnamed: 0'])

In [24]:
df_products.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [25]:
# "Unnamed: 0" and "_merge" column not needed 
df_ords_products_combined.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [32]:
df_ords_products_combined = df_ords_products_combined.drop(columns = ['Unnamed: 0', '_merge'])

In [33]:
# columns after droppung "Unnamed: 0" and "_merge" column
df_ords_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

In [34]:
df_ords_products_combined.shape

(32434489, 9)

In [35]:
df_products.shape

(49672, 5)

In [ ]:
# After removing the unnecessary columns we have 9 columns in the df_ords_products_combined (we had 11 before), and 5 columns in the df_products (we had 6 before).

In [36]:
# Combining both data frames, mutual key = "product_id"
# As expected I did run into memory error issues, after trying a few ways suggested by "troubleshooting Jupyter notebook (.ipynb)", I could finally merge the frames.

df_merged_orders_porducts = df_ords_products_combined.merge(df_products, on = 'product_id', indicator = True)

In [38]:
df_merged_orders_porducts.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

In [37]:
df_merged_orders_porducts.shape

(32404859, 14)

In [40]:
# Confirming the results of the merge using the merge flag
df_merged_orders_porducts['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [41]:
# Export data to pkl

df_merged_orders_porducts.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'merged_orders_products.pkl'))